lvx/base/Enums/ВидыОперацийСАТУРН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСАТУРН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктИнвентаризацииИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктИнвентаризацииПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктИнвентаризацииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктИнвентаризацииСозданиеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктИнвентаризацииЧтениеАктуальногоОстатка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктИнвентаризацииЧтениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПримененияАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПримененияИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПримененияПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПримененияРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПримененияСозданиеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенерацияТокенаАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОстатковПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОстатковПартийЗапросРодительскихПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОстатковПартийРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортируемаяПартияЗапросКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортПродукцииИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортПродукцииОтменаПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортПродукцииПодтверждениеПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортПродукцииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортПродукцииРасчетСтатусовПоДокументу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортПродукцииЧтениеПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоПримененияЗапросКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоХраненияЗапросКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяВозврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяВозвратИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяВозвратРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяГрузУтерян</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяГрузУтерянИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяГрузУтерянРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЗагрузкаДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЗагрузкаДокументовРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЗагрузкаДокументовЧтение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЗагрузкаСтатусов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЗагрузкаСтатусовРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЗагрузкаСтатусовЧтение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПеревозка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПеревозкаАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеАннулированиеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеВозврата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеВозвратаИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеВозвратаРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеУтериГрузаПриВозврате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеУтериГрузаПриВозвратеИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеУтериГрузаПриВозвратеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеЧастичногоВозврата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеЧастичнойПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяПодтверждениеЧтение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяРозничнаяТорговля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяРозничнаяТорговляАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяСозданиеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяСписаниеВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяСписаниеВПроизводствоАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяУтилизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяУтилизацияАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЧтениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортОтказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортОтказИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортОтказРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортПодтверждениеИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортПодтверждениеПриемаНаДосмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортПодтверждениеПриемаНаДосмотрИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортПодтверждениеПриемаНаДосмотрРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортПодтверждениеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортЧерезПунктДосмотра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакладнаяЭкспортЧерезПунктДосмотраАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияЗапросКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияИзменениеКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияСменаСтатусаИзЧерновикаВАктуально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияСменаСтатусаИзЧерновикаВОтменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияСозданиеКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартияЗапросКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПАТЗапросКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПАТИзменениеКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПАТСменаСтатусаИзЧерновикаВОтменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПАТСменаСтатусаИзЧерновикВАктуально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПАТСозданиеКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланПримененияАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланПримененияИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланПримененияПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланПримененияРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланПримененияРасчетСтатусовПоДокументу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланПримененияСозданиеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеТокенаАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственнаяОперацияАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственнаяОперацияИзменениеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственнаяОперацияПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственнаяОперацияРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственнаяОперацияСозданиеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственнаяОперацияЧтениеДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Enums/ВидыОперацийСАТУРН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЭтоАбстрактнаяОперация(ВидОперации) Экспорт
	
	Если АбстрактныеОперации().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЭтоОперацияРаботыСКлассификаторами(ВидОперации) Экспорт

	Если ОперацииРаботыСКлассификаторами().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ЭтоОперацияЗагрузкиДокументов(ВидОперации) Экспорт

	Если ВидОперации = НакладнаяЗагрузкаДокументов
		Или ВидОперации = НакладнаяЗагрузкаДокументовРасчетСтатуса
		Или ВидОперации = НакладнаяЗагрузкаСтатусов
		Или ВидОперации = НакладнаяЗагрузкаСтатусовРасчетСтатуса Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ЭтоЗапросСписка(Операция) Экспорт
	
	Возврат Операция = НакладнаяЗагрузкаСтатусов;
	
КонецФункции

Функция ОперацияЯвляетсяОснованием(ВидОперации) Экспорт
	
	Если ОперацииОснования().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция АбстрактныеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(АктИнвентаризацииРасчетСтатуса);
	МассивОпераций.Добавить(АктПримененияРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросОстатковПартийРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(НакладнаяРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяВозвратРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеВозвратаРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеУтериГрузаПриВозвратеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяГрузУтерянРасчетСтатуса);
	МассивОпераций.Добавить(ПроизводственнаяОперацияРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЗагрузкаДокументовРасчетСтатуса);
	МассивОпераций.Добавить(ПланПримененияРасчетСтатуса);
	МассивОпераций.Добавить(ПланПримененияРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(НакладнаяЗагрузкаСтатусовРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеАннулированиеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортПодтверждениеПриемаНаДосмотрРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортОтказРасчетСтатуса);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииОснования() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(АктИнвентаризацииРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяВозвратРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеВозвратаРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеУтериГрузаПриВозвратеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяГрузУтерянРасчетСтатуса);
	МассивОпераций.Добавить(АктПримененияРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(ПроизводственнаяОперацияРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросОстатковПартийРасчетСтатуса);
	МассивОпераций.Добавить(ПланПримененияРасчетСтатуса);
	
	МассивОпераций.Добавить(НакладнаяЭкспортПодтверждениеПриемаНаДосмотрРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортОтказРасчетСтатуса);
	
	МассивОпераций.Добавить(НакладнаяПодтверждениеАннулированиеРасчетСтатуса);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииРасчетСтатуса() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ПланПримененияРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(НакладнаяЗагрузкаСтатусовРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЗагрузкаСтатусов);
	МассивОпераций.Добавить(НакладнаяЗагрузкаДокументовРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЗагрузкаДокументов);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатусовПоДокументу);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииРаботыСКлассификаторами() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ПАТСозданиеКлассификатора);
	МассивОпераций.Добавить(ПАТИзменениеКлассификатора);
	МассивОпераций.Добавить(ПАТСменаСтатусаИзЧерновикаВОтменено);
	МассивОпераций.Добавить(ПАТСменаСтатусаИзЧерновикВАктуально);
	
	МассивОпераций.Добавить(ОрганизацияЗапросКлассификатора);
	МассивОпераций.Добавить(ПАТЗапросКлассификатора);
	МассивОпераций.Добавить(МестоПримененияЗапросКлассификатора);
	МассивОпераций.Добавить(МестоХраненияЗапросКлассификатора);
	МассивОпераций.Добавить(ПартияЗапросКлассификатора);
	МассивОпераций.Добавить(ИмпортируемаяПартияЗапросКлассификатора);
	
	МассивОпераций.Добавить(ОрганизацияСозданиеКлассификатора);
	МассивОпераций.Добавить(ОрганизацияИзменениеКлассификатора);
	МассивОпераций.Добавить(ОрганизацияСменаСтатусаИзЧерновикаВОтменено);
	МассивОпераций.Добавить(ОрганизацияСменаСтатусаИзЧерновикаВАктуально);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция БазовыеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	Возврат МассивОпераций;
	
КонецФункции

#КонецОбласти

#КонецЕсли
